app/controllers/request_movies_controller.rb

SELECT "request_movies".* FROM "request_movies"
---
  def index
    @request_movies = RequestMovie.all

INSERT INTO "request_movies" ("movie_name", "actor_name", "today_date", "language", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @request_movie = RequestMovie.new(request_movie_params)

    respond_to do |format|
      if @request_movie.save

SELECT  "request_movies".* FROM "request_movies" WHERE "request_movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_request_movie
      @request_movie = RequestMovie.find(params[:id])